{
  "MAT": {
    "171": {
      "title": "Precalculus Algebra",
      "credit-hours": "4",
      "class-hours": "3",
      "lab-hours": "2",
      "prerequisites": "Please refer to the Mitchell Community College Catalog for more information.",
      "catalog-description": "This course is designed to develop topics which are fundamental to the study of Calculus. Emphasis is placed on solving equations and inequalities, solving systems of equations and inequalities, and  analysis of functions (absolute value, radical, polynomial, rational, exponential, and logarithmic) in multiple representations. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to algebra-related problems with and without technology. This course has been approved for transfer under the CAA as a general education course in Mathematics. This course has been approved for transfer under the ICAA as a general education course in Mathematics.",
      "slos": [
        "SLO1: Use analytical, graphical, and numerical representations to solve absolute value, radical, polynomial, rational, exponential, and logarithmic equations with both real and complex solutions.",
        "SLO2: Use analytical, graphical, and numerical representations to solve absolute value, polynomial and rational inequalities with real solutions.",
        "SLO3: Use analytical, graphical, and numerical representations to analyze absolute value, radical, polynomial, rational, exponential and logarithmic functions with both real and complex zeros.",
        "SLO4: Use multiple methods to solve problems involving systems of equations.",
        "SLO5: Apply multiple methods to decomposing partial fractions.",
        "SLO6: Construct the composition and inverse of functions.",
        "SLO7: Use polynomial, exponential and logarithmic functions to model various real-world situations in order to analyze, draw conclusions, and make predictions.",
        "SLO8: Apply quantitative reasoning to solve problems."
      ]
    }
  }
}